	IDENTIFICATION DIVISION.
	PROGRAM-ID. FIBONACCI.
	AUTHOR. EVELYN.

	DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 WS-TARGET	PIC 9(10).
	01 WS-SOLUTION	PIC 9(10).

	PROCEDURE DIVISION.
	DISPLAY "ENTER FIBONACCI TARGET: ".
	ACCEPT WS-TARGET.

	CALL "RECURSION" USING WS-TARGET WS-SOLUTION.

	DISPLAY "THE TARGET FIBONACCI NUMBER IS " WS-SOLUTION.
	STOP RUN.
	END PROGRAM FIBONACCI.

      * -----------------------------------------

	IDENTIFICATION DIVISION.
	PROGRAM-ID. RECURSION.

	DATA DIVISION.
	LOCAL-STORAGE SECTION.
	01 LS-COMPONENT1 PIC 9(10).
	01 LS-COMPONENT2 PIC 9(10).
	01 LS-SUBTARGET1 PIC 9(10).
	01 LS-SUBTARGET2 PIC 9(10).

	LINKAGE SECTION.
	01 LN-TARGET	PIC 9(10).
	01 LN-RETURN	PIC 9(10).

	PROCEDURE DIVISION USING LN-TARGET LN-RETURN.
	EVALUATE LN-TARGET
	WHEN 0
	MOVE 0 TO LN-RETURN
	WHEN 1
	MOVE 1 TO LN-RETURN
	WHEN OTHER
	COMPUTE LS-SUBTARGET1 = LN-TARGET - 1
	COMPUTE LS-SUBTARGET2 = LN-TARGET - 2
	CALL "RECURSION" USING LS-SUBTARGET1 LS-COMPONENT1
	CALL "RECURSION" USING LS-SUBTARGET2 LS-COMPONENT2
	COMPUTE LN-RETURN = LS-COMPONENT1 + LS-COMPONENT2
	END-EVALUATE.
	END PROGRAM RECURSION.
