	IDENTIFICATION DIVISION.
	PROGRAM-ID. FIBONACCI.
	AUTHOR. EVELYN.

	DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 WS-TARGET	PIC 9(10).
	01 WS-FINAL	PIC 9(10).
	01 WS-SOLUTIONS.
	  02 WS-SOLUTION-STORAGE
		PIC 9(10) VALUE 0
		OCCURS 100 TIMES
		INDEXED BY WS-AT.

	PROCEDURE DIVISION.
	DISPLAY "ENTER FIBONACCI TARGET (MAX 100): ".
	ACCEPT WS-TARGET.

	CALL "RECURSION" USING WS-TARGET WS-SOLUTIONS.
	SET WS-AT TO WS-TARGET
	MOVE WS-SOLUTION-STORAGE(WS-AT) TO WS-FINAL
	DISPLAY "THE TARGET FIBONACCI NUMBER IS " WS-FINAL.
	STOP RUN.
	END PROGRAM FIBONACCI.

      * -----------------------------------------

	IDENTIFICATION DIVISION.
	PROGRAM-ID. RECURSION.

	DATA DIVISION.
	LOCAL-STORAGE SECTION.
	01 LS-COMPONENT1 PIC 9(10).
	01 LS-COMPONENT2 PIC 9(10).
	01 LS-SUBTARGET1 PIC 9(10).
	01 LS-SUBTARGET2 PIC 9(10).

	LINKAGE SECTION.
	01 LN-TARGET	PIC 9(10).
	01 LN-RETURN	PIC 9(10).
	01 LN-DATA.
	  02 LN-DATA-STORAGE
		PIC 9(10)
		OCCURS 100 TIMES
		INDEXED BY LN-AT.

	PROCEDURE DIVISION USING LN-TARGET LN-RETURN.
	SET LN-AT TO LN-TARGET.
	EVALUATE LN-TARGET
	WHEN 0
	MOVE 0 TO LN-DATA-STORAGE(LN-AT)
	WHEN 1
	MOVE 1 TO LN-DATA-STORAGE(LN-AT)
	WHEN OTHER
	EVALUATE LN-DATA-STORAGE(LN-AT)
	WHEN 0
	COMPUTE LS-SUBTARGET1 = LN-TARGET - 1
	COMPUTE LS-SUBTARGET1 = LN-TARGET - 2
	CALL "RECURSION" USING LS-SUBTARGET1 LS-COMPONENT1
	CALL "RECURSION" USING LS-SUBTARGET2 LS-COMPONENT2
	COMPUTE LN-DATA-STORAGE(LN-AT) = LS-COMPONENT1 + LS-COMPONENT2
	END-EVALUATE
	END-EVALUATE.
	END PROGRAM RECURSION.
